public enum TestState
{
    // --- 1. Инициализация и Конфиг ---       
    Initializing=0,           // Загрузка
    Idle=1,                   // Простой
    Configuring=2,            // Смена оснастки (Workflow)

    // --- 2. Модальные действия (Блокирующие) ---
    GripAnimating=21,          // Анимация захватов
    TraverseManualMoving=5,   // Ручное движение траверсы (пока нажата кнопка)
    AutoApproaching=22,        // Авто-подвод

    // --- 3. Гидравлика (Специфично) ---
    HydraulicManualMoving=23,  // Рама едет (активная фаза)
    HydraulicReturning=24,     // Рама возвращается в ноль

    // --- 4. Настройка (Setup) ---
    // (Образец в сцене — это просто флаг в мониторе)
    // (Траверса находится на позиции подвода - это просто флаг в мониторе)
    ReadyForSetup=3,          // Основное состояние. 
    ReadyToTest=6,            // Всё готово (зажато, лимиты ок). Ждем СТАРТ

    // --- 5. Тест ---
    TestRunning=7,            // Тест идет
    TestPaused=8,             // Тест на паузе

    //----------------------------------------------------------------------------
    // Состояния без хэндлеров
        AwaitingExtensometerAttach=13,  //Ожидание установки экстензометра
        AwaitingExtensometerRemove=14,  //Ожидание снятия экстензометра
    //----------------------------------------------------------------------------
    ExtensometerActionState=27,

    // --- 6. Результаты (Твой выбор) ---
    TestFinished_SampleUnderLoad=9,   // Испытание закончено, образец под нагрузкой. Опасно
    TestResult_SampleSafe=25,        // Испытание закончено, образец не нагружен/убран. Безопасно

    // --- 7. Форс-мажор ---
    EmergencyStop=26,
    Error=15
}